Masmiseim36/nxpSDK/boards/evkmimxrt1020/project_template/pin_mux.h
/* GPIO_EMC_23 (number 133), SEMC_A7/U14[32]/BT_CFG[5] */
#define BOARD_INITSDRAM_SEMC_A7_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A7_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A7_CHANNEL                                       7U   /*!< SEMC ADDR channel: 07 */
#define BOARD_INITSDRAM_SEMC_A7_PIN_NAME                             GPIO_EMC_23   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_A7_LABEL                "SEMC_A7/U14[32]/BT_CFG[5]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_A7_NAME                                   "SEMC_A7"   /*!< Identifier name */

/* GPIO_EMC_24 (number 132), SEMC_A8/U14[33]/BT_CFG[6] */
#define BOARD_INITSDRAM_SEMC_A8_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A8_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A8_CHANNEL                                       8U   /*!< SEMC ADDR channel: 08 */
#define BOARD_INITSDRAM_SEMC_A8_PIN_NAME                             GPIO_EMC_24   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_A8_LABEL                "SEMC_A8/U14[33]/BT_CFG[6]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_A8_NAME                                   "SEMC_A8"   /*!< Identifier name */

/* GPIO_EMC_25 (number 131), SEMC_A9/U14[34]/BT_CFG[7] */
#define BOARD_INITSDRAM_SEMC_A9_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A9_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A9_CHANNEL                                       9U   /*!< SEMC ADDR channel: 09 */
#define BOARD_INITSDRAM_SEMC_A9_PIN_NAME                             GPIO_EMC_25   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_A9_LABEL                "SEMC_A9/U14[34]/BT_CFG[7]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_A9_NAME                                   "SEMC_A9"   /*!< Identifier name */

/* GPIO_EMC_15 (number 143), SEMC_A10/U14[22] */
#define BOARD_INITSDRAM_SEMC_A10_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A10_SIGNAL                                     ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A10_CHANNEL                                     10U   /*!< SEMC ADDR channel: 10 */
#define BOARD_INITSDRAM_SEMC_A10_PIN_NAME                            GPIO_EMC_15   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_A10_LABEL                        "SEMC_A10/U14[22]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_A10_NAME                                 "SEMC_A10"   /*!< Identifier name */

/* GPIO_EMC_26 (number 130), SEMC_A11/U14[35]/BT_CFG[8] */
#define BOARD_INITSDRAM_SEMC_A11_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A11_SIGNAL                                     ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A11_CHANNEL                                     11U   /*!< SEMC ADDR channel: 11 */
#define BOARD_INITSDRAM_SEMC_A11_PIN_NAME                            GPIO_EMC_26   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_A11_LABEL              "SEMC_A11/U14[35]/BT_CFG[8]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_A11_NAME                                 "SEMC_A11"   /*!< Identifier name */

/* GPIO_EMC_27 (number 129), SEMC_A12/U14[36]/BT_CFG[9] */
#define BOARD_INITSDRAM_SEMC_A12_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A12_SIGNAL                                     ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A12_CHANNEL                                     12U   /*!< SEMC ADDR channel: 12 */
#define BOARD_INITSDRAM_SEMC_A12_PIN_NAME                            GPIO_EMC_27   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_A12_LABEL              "SEMC_A12/U14[36]/BT_CFG[9]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_A12_NAME                                 "SEMC_A12"   /*!< Identifier name */

/* GPIO_EMC_13 (number 2), SEMC_BA0/U14[20] */
#define BOARD_INITSDRAM_SEMC_BA0_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_BA0_SIGNAL                                       BA   /*!< SEMC signal: BA */
#define BOARD_INITSDRAM_SEMC_BA0_CHANNEL                                      0U   /*!< SEMC BA channel: 0 */
#define BOARD_INITSDRAM_SEMC_BA0_PIN_NAME                            GPIO_EMC_13   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_BA0_LABEL                        "SEMC_BA0/U14[20]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_BA0_NAME                                 "SEMC_BA0"   /*!< Identifier name */

/* GPIO_EMC_14 (number 1), SEMC_BA1/U14[21] */
#define BOARD_INITSDRAM_SEMC_BA1_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_BA1_SIGNAL                                       BA   /*!< SEMC signal: BA */
#define BOARD_INITSDRAM_SEMC_BA1_CHANNEL                                      1U   /*!< SEMC BA channel: 1 */
#define BOARD_INITSDRAM_SEMC_BA1_PIN_NAME                            GPIO_EMC_14   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_BA1_LABEL                        "SEMC_BA1/U14[21]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_BA1_NAME                                 "SEMC_BA1"   /*!< Identifier name */

/* GPIO_EMC_10 (number 7), SEMC_CAS/U14[17] */
#define BOARD_INITSDRAM_SEMC_CAS_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_CAS_SIGNAL                                 semc_cas   /*!< SEMC signal: semc_cas */
#define BOARD_INITSDRAM_SEMC_CAS_PIN_NAME                            GPIO_EMC_10   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_CAS_LABEL                        "SEMC_CAS/U14[17]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_CAS_NAME                                 "SEMC_CAS"   /*!< Identifier name */

/* GPIO_EMC_29 (number 127), SEMC_CKE/U14[37] */
#define BOARD_INITSDRAM_SEMC_CKE_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_CKE_SIGNAL                                 semc_cke   /*!< SEMC signal: semc_cke */
#define BOARD_INITSDRAM_SEMC_CKE_PIN_NAME                            GPIO_EMC_29   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_CKE_LABEL                        "SEMC_CKE/U14[37]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_CKE_NAME                                 "SEMC_CKE"   /*!< Identifier name */

