Masmiseim36/nxpSDK/boards/evkmimxrt1020/project_template/pin_mux.h
/* GPIO_EMC_34 (number 122), SEMC_D10/U14[45] */
#define BOARD_INITSDRAM_SEMC_D10_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D10_SIGNAL                                     DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D10_CHANNEL                                     10U   /*!< SEMC DATA channel: 10 */
#define BOARD_INITSDRAM_SEMC_D10_PIN_NAME                            GPIO_EMC_34   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D10_LABEL                        "SEMC_D10/U14[45]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D10_NAME                                 "SEMC_D10"   /*!< Identifier name */

/* GPIO_EMC_35 (number 121), SEMC_D11/U14[47] */
#define BOARD_INITSDRAM_SEMC_D11_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D11_SIGNAL                                     DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D11_CHANNEL                                     11U   /*!< SEMC DATA channel: 11 */
#define BOARD_INITSDRAM_SEMC_D11_PIN_NAME                            GPIO_EMC_35   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D11_LABEL                        "SEMC_D11/U14[47]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D11_NAME                                 "SEMC_D11"   /*!< Identifier name */

/* GPIO_EMC_33 (number 123), SEMC_D9/U14[44] */
#define BOARD_INITSDRAM_SEMC_D9_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D9_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D9_CHANNEL                                       9U   /*!< SEMC DATA channel: 09 */
#define BOARD_INITSDRAM_SEMC_D9_PIN_NAME                             GPIO_EMC_33   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D9_LABEL                          "SEMC_D9/U14[44]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D9_NAME                                   "SEMC_D9"   /*!< Identifier name */

/* GPIO_EMC_32 (number 124), SEMC_D8/U14[42] */
#define BOARD_INITSDRAM_SEMC_D8_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D8_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D8_CHANNEL                                       8U   /*!< SEMC DATA channel: 08 */
#define BOARD_INITSDRAM_SEMC_D8_PIN_NAME                             GPIO_EMC_32   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D8_LABEL                          "SEMC_D8/U14[42]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D8_NAME                                   "SEMC_D8"   /*!< Identifier name */

/* GPIO_EMC_07 (number 10), SEMC_D7/U14[13] */
#define BOARD_INITSDRAM_SEMC_D7_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D7_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D7_CHANNEL                                       7U   /*!< SEMC DATA channel: 07 */
#define BOARD_INITSDRAM_SEMC_D7_PIN_NAME                             GPIO_EMC_07   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D7_LABEL                          "SEMC_D7/U14[13]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D7_NAME                                   "SEMC_D7"   /*!< Identifier name */

/* GPIO_EMC_06 (number 12), SEMC_D6/U14[11] */
#define BOARD_INITSDRAM_SEMC_D6_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D6_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D6_CHANNEL                                       6U   /*!< SEMC DATA channel: 06 */
#define BOARD_INITSDRAM_SEMC_D6_PIN_NAME                             GPIO_EMC_06   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D6_LABEL                          "SEMC_D6/U14[11]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D6_NAME                                   "SEMC_D6"   /*!< Identifier name */

/* GPIO_EMC_05 (number 13), SEMC_D5/U14[10] */
#define BOARD_INITSDRAM_SEMC_D5_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D5_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D5_CHANNEL                                       5U   /*!< SEMC DATA channel: 05 */
#define BOARD_INITSDRAM_SEMC_D5_PIN_NAME                             GPIO_EMC_05   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D5_LABEL                          "SEMC_D5/U14[10]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D5_NAME                                   "SEMC_D5"   /*!< Identifier name */

/* GPIO_EMC_04 (number 14), SEMC_D4/U14[8] */
#define BOARD_INITSDRAM_SEMC_D4_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D4_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D4_CHANNEL                                       4U   /*!< SEMC DATA channel: 04 */
#define BOARD_INITSDRAM_SEMC_D4_PIN_NAME                             GPIO_EMC_04   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D4_LABEL                           "SEMC_D4/U14[8]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D4_NAME                                   "SEMC_D4"   /*!< Identifier name */

/* GPIO_EMC_03 (number 15), SEMC_D3/U14[7] */
#define BOARD_INITSDRAM_SEMC_D3_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D3_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D3_CHANNEL                                       3U   /*!< SEMC DATA channel: 03 */
#define BOARD_INITSDRAM_SEMC_D3_PIN_NAME                             GPIO_EMC_03   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D3_LABEL                           "SEMC_D3/U14[7]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D3_NAME                                   "SEMC_D3"   /*!< Identifier name */

/* GPIO_EMC_02 (number 16), SEMC_D2/U14[5] */
#define BOARD_INITSDRAM_SEMC_D2_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D2_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D2_CHANNEL                                       2U   /*!< SEMC DATA channel: 02 */
#define BOARD_INITSDRAM_SEMC_D2_PIN_NAME                             GPIO_EMC_02   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D2_LABEL                           "SEMC_D2/U14[5]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D2_NAME                                   "SEMC_D2"   /*!< Identifier name */

/* GPIO_EMC_01 (number 17), SEMC_D1/U14[4] */
#define BOARD_INITSDRAM_SEMC_D1_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D1_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D1_CHANNEL                                       1U   /*!< SEMC DATA channel: 01 */
#define BOARD_INITSDRAM_SEMC_D1_PIN_NAME                             GPIO_EMC_01   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D1_LABEL                           "SEMC_D1/U14[4]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D1_NAME                                   "SEMC_D1"   /*!< Identifier name */

/* GPIO_EMC_00 (number 18), SEMC_D0/U14[2] */
#define BOARD_INITSDRAM_SEMC_D0_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D0_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D0_CHANNEL                                       0U   /*!< SEMC DATA channel: 00 */
#define BOARD_INITSDRAM_SEMC_D0_PIN_NAME                             GPIO_EMC_00   /*!< Pin name */
#define BOARD_INITSDRAM_SEMC_D0_LABEL                           "SEMC_D0/U14[2]"   /*!< Label */
#define BOARD_INITSDRAM_SEMC_D0_NAME                                   "SEMC_D0"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAM(void);

/* GPIO_SD_B1_01 (number 32), CAN1_RX/U9[4] */
#define BOARD_INITCAN_CAN1_RX_PERIPHERAL                                    CAN1   /*!< Device name: CAN1 */
#define BOARD_INITCAN_CAN1_RX_SIGNAL                                          RX   /*!< CAN1 signal: RX */
#define BOARD_INITCAN_CAN1_RX_PIN_NAME                             GPIO_SD_B1_01   /*!< Pin name */
#define BOARD_INITCAN_CAN1_RX_LABEL                              "CAN1_RX/U9[4]"   /*!< Label */
#define BOARD_INITCAN_CAN1_RX_NAME                                     "CAN1_RX"   /*!< Identifier name */

/* GPIO_SD_B1_00 (number 33), CAN1_TX/U9[1] */
#define BOARD_INITCAN_CAN1_TX_PERIPHERAL                                    CAN1   /*!< Device name: CAN1 */
#define BOARD_INITCAN_CAN1_TX_SIGNAL                                          TX   /*!< CAN1 signal: TX */
#define BOARD_INITCAN_CAN1_TX_PIN_NAME                             GPIO_SD_B1_00   /*!< Pin name */
#define BOARD_INITCAN_CAN1_TX_LABEL                              "CAN1_TX/U9[1]"   /*!< Label */
#define BOARD_INITCAN_CAN1_TX_NAME                                     "CAN1_TX"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCAN(void);

/* GPIO_AD_B0_11 (number 97), ENET_CRS_DV/U11[18]/J19[3] */
#define BOARD_INITENET_ENET_CRS_DV_PERIPHERAL                               ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_CRS_DV_SIGNAL                             enet_rx_en   /*!< ENET signal: enet_rx_en */
#define BOARD_INITENET_ENET_CRS_DV_PIN_NAME                        GPIO_AD_B0_11   /*!< Pin name */
#define BOARD_INITENET_ENET_CRS_DV_LABEL            "ENET_CRS_DV/U11[18]/J19[3]"   /*!< Label */
#define BOARD_INITENET_ENET_CRS_DV_NAME                            "ENET_CRS_DV"   /*!< Identifier name */

/* GPIO_AD_B1_06 (number 84), ENET_INT/U11[21]/J17[8] */
#define BOARD_INITENET_ENET_INT_GPIO                                       GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITENET_ENET_INT_PORT                                       GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITENET_ENET_INT_GPIO_PIN                                     22U   /*!< GPIO1 pin index: 22 */
#define BOARD_INITENET_ENET_INT_PIN_NAME                           GPIO_AD_B1_06   /*!< Pin name */
#define BOARD_INITENET_ENET_INT_LABEL                  "ENET_INT/U11[21]/J17[8]"   /*!< Label */
#define BOARD_INITENET_ENET_INT_NAME                                  "ENET_INT"   /*!< Identifier name */

/* GPIO_AD_B0_04 (number 107), JTAG_TDO/J16[13]/ENET_RST/U11[32] */
#define BOARD_INITENET_ENET_RST_GPIO                                       GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITENET_ENET_RST_PORT                                       GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITENET_ENET_RST_GPIO_PIN                                      4U   /*!< GPIO1 pin index: 4 */
#define BOARD_INITENET_ENET_RST_PIN_NAME                           GPIO_AD_B0_04   /*!< Pin name */
#define BOARD_INITENET_ENET_RST_LABEL        "JTAG_TDO/J16[13]/ENET_RST/U11[32]"   /*!< Label */
#define BOARD_INITENET_ENET_RST_NAME                                  "ENET_RST"   /*!< Identifier name */

/* GPIO_AD_B0_08 (number 100), ENET_TX_CLK/U11[9] */
#define BOARD_INITENET_ENET_TX_CLK_PERIPHERAL                               ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_TX_CLK_SIGNAL                            enet_tx_clk   /*!< ENET signal: enet_tx_clk */
#define BOARD_INITENET_ENET_TX_CLK_PIN_NAME                        GPIO_AD_B0_08   /*!< Pin name */
#define BOARD_INITENET_ENET_TX_CLK_LABEL                    "ENET_TX_CLK/U11[9]"   /*!< Label */
#define BOARD_INITENET_ENET_TX_CLK_NAME                            "ENET_TX_CLK"   /*!< Identifier name */

